# HAreaN

## Description
Compute the area of a given object, it has the same function as HArea(), but the result in case of polyline is more accurate.

```pascal
FUNCTION HAreaN(ObjectHandle : HANDLE) : REAL;
```

```python

def vs.HAreaN(ObjectHandle):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ObjectHandle|HANDLE|It is the object we want to calculate its area.|

## Examples
```pascal
HAreaN(object);
```

## Version
Availability: from Vectorworks 2012
## Category
* Object Info